# Практическое задание по уроку "Базовые структуры данных"
# Задача «Длина слова»
a='external'
print(len(a))
# Задача «Суммы и разности»
first=10
second=12
summa=(first+second)
diff=(first-second)
print(summa)
print(diff)
# Задача «Среднее арифметическое»
first=13
second=14
third=15
mean=((first+second+third)//3)
print(mean)
# Задача «Простые строчки»
firststring='понедельник,'
secondstring='вторник'
print(firststring,secondstring)
# Задача «Сложная формула»
a=22
b=20
c=32
f=(((a*b)+(a*c))**3)/2
print(f)